examples/state-machine/expected.dot
digraph FSM {
    rankdir=LR;
    node [shape=box style=rounded];
    Draft -> Cancelled [label="Cancel"];
    Draft -> Submitted [label="Submit"];
    Submitted -> Cancelled [label="Cancel"];
    Submitted -> Expired [label="Expire after 60.seconds"];
    Submitted -> Paid [label="Pay"];
}
